{
    "1.0.0": {
        "Update Summary": [
            "This is a big release, fixes a lot of the nuances of the first release"
        ],
        "Whats New": [
            "First release",
            "Basic functions including browsing meals, adding meals to the plan"
        ],
        "Fixes": [
            "None - First release"
        ]
    },
    "2.0.0": {
        "Update Summary": [
            "This is a big release, fixes a lot of the nuances of the first release"
        ],
        "Whats New": [
            "Added ability to multi select items from the meal selection window using shift key",
            "Added ability to export and load databases via the file option in menu",
            "Added ability to clear a single day from the plan (Right click and remove it)",
            "Added ability to supply a new category, if it doesn't exist.",
            "Added the ability to see the selected meal's category",
            "Added the ability to export Meal plan & ingredients to a text file",
            "Each main GUI box now has a tooltip explaining what to do",
            "Added a date selection calendar to allow you to pick and plan future weeks"
        ],
        "Fixes": [
            "Updated working for some buttons and texts",
            "Increase font size for error messages",
            "Numerous bugs and strangeness"
        ]
    },
    "2.1.0": {
        "Update Summary": [
            "Fixed a bunch of small things to make the app more user friendly"
        ],
        "Whats New": [
            "Added the ability to delete a plan from the database permenantly"
        ],
        "Fixes": [
            "Fixed bug with adding meals to the plan, this should now work correctly",
            "Fixed a bug with the date picker picking the wrong date"
        ]
    },
    "3.0.0": {
        "Update Summary": [
            "Release of Recipe Interface and all the related work. Provide a recipe link and let the app interpret it for you!"
        ],
        "Whats New": [
            "Recipe Interface!",
            "Ability to provide a detailed recipe with quantities and instructions, stored in the database",
            "Ability to decode a recipe link into a structured recipe",
            "Additional menu items - Edit, Help. Additional ways to edit your meals, plans, and recipes."
        ],
        "Fixes": [
            "Numerous fixes across the board for ease of use."
        ]
    }
}